{"0":{"TYPE":"Religious","ORGANIZATION":"Affirmation Houston Chapter (LDS)","DESCRIPTION\/MISSION":"As members and friends of the gay and lesbian community, it is our intention to work for the understanding and acceptance of gays and lesbians as full, equal and worthy persons within the Church of Jesus Christ of Latter-day Saints and society, and to help them realize and affirm self-worth.","WEBSITE":"www.affirmation.org"},"1":{"TYPE":"Education & Services","ORGANIZATION":"AIDS Foundation Houston, Inc.","DESCRIPTION\/MISSION":"AIDS foundation lead the innovative efforts in the prevention of new HIV infections and to empower individuals, families, and communities affected by HIV\/AIDS to create and sustain healthy lives. AIDS Foundation Houston, Inc. envisions a supportive community free of new HIV infections where individuals affected by HIV\/AIDS lead healthy and productive lives without stigma and discrimination","WEBSITE":"www.aidshelp.org"},"2":{"TYPE":"Social","ORGANIZATION":"Alpha Lambda Zeta Fraternity","DESCRIPTION\/MISSION":"Alpha Lambda Zeta (Î\u0091Î\u009bÎ\u0096), an LGBT Greek-Lettered Organization, is a national non-collegiate service fraternity for pre-professional and professional masculine-identified lesbians who seek to promote positive images of the LGBT community through service to the community and political change.","WEBSITE":"www.alphalambdazeta.com"},"3":{"TYPE":"Education & Services","ORGANIZATION":"South Texas College of Law - AMICUS","DESCRIPTION\/MISSION":"Amicus educates, advises and informs its members and the College community about issues and concerns, particularly in the practice of law, that affect gay, lesbian, bisexual and transgendered (GLBT) people. Since its formation in 1994, Amicus has served to establish a greater voice and respect for GLBT persons at the College. By providing a forum that brings GLBT students into contact not only with each other, but also with other students, faculty, administrators, staff, and alumni who share their goals, Amicus promotes an enhanced sense of GLBT community at Houston College of Law. And the College community, in general, benefits from the social and educational programs that Amicus sponsors, bothÂ independently and in conjunction with other student organizations. Legal. Education","WEBSITE":"http:\/\/www.stcl.edu\/student-services\/student-organizations\/organizations\/organization-websites\/amicus\/"},"4":{"TYPE":"History","ORGANIZATION":"Area Rainbow Collective History - Houston","DESCRIPTION\/MISSION":"ARCH was established as a coalition of Houston archivists to preserve and document Houston lesbian, gay, bisexual, transgender, and queer history.","WEBSITE":"http:\/\/houstonarch.pbworks.com\/w\/page\/19526143\/FrontPage"},"5":{"TYPE":"Social","ORGANIZATION":"Asians & Friends","DESCRIPTION\/MISSION":"Asians & Friends Houston, is a social group for gay and lesbian Asians, Asian-Americans, Pacific Islanders, and anyone interested in the cultures of Asia.","WEBSITE":"http:\/\/asiansandfriends.wixsite.com\/asians-n-friends-tx"},"6":{"TYPE":"Education & Services","ORGANIZATION":"AssistHers","DESCRIPTION\/MISSION":"Helping lesbians with disabilities or chronic illnesses live as normally as possible.","WEBSITE":"www.assisthers.org"},"7":{"TYPE":"Social","ORGANIZATION":"Bayou City Boys Club","DESCRIPTION\/MISSION":"Bayou City Boys Club is a Houston based non profit dedicated to raising money for HIV\/AIDS.","WEBSITE":"https:\/\/www.facebook.com\/groups\/15932657556\/"},"8":{"TYPE":"Arts","ORGANIZATION":"Bayou City Men's Chorus","DESCRIPTION\/MISSION":"The Gay Menâ\u0080\u0099s Chorus of Houston welcomes all men, regardless of age, race, sexual orientation, ability to read music or prior chorus experience.","WEBSITE":"http:\/\/www.bcpahouston.org"},"9":{"TYPE":"Arts","ORGANIZATION":"Bayou City Performing Arts","DESCRIPTION\/MISSION":"Bayou city performing arts promotes organizations that, through music, theatre and other forms of artistic expression, advance tolerance, social justice and inclusiveness. Our performers are diverse groups of artists who combine a love of their art form with a commitment to excellence.","WEBSITE":"http:\/\/www.bcpahouston.org"},"10":{"TYPE":"Social","ORGANIZATION":"Bayou City Pups","DESCRIPTION\/MISSION":"We are committed to providing an outlet for social, recreational and educational activities among adults of like mind: pups, handlers and supporters.","WEBSITE":"http:\/\/www.bayoucitypups.com\/"},"11":{"TYPE":"Arts","ORGANIZATION":"Bayou City Women's Chorus","DESCRIPTION\/MISSION":"The Bayou City Womenâ\u0080\u0099s Chorus was the second choral group to emerge from Bayou City Performing Arts. Established in January 2005, the chorus grew in numbers from 5 singers to as many as 65 singers. We are a diverse group of women who come together for one simple purpose: to sing as one voice.","WEBSITE":"http:\/\/www.bcpahouston.org"},"12":{"TYPE":"Education & Services","ORGANIZATION":"Brentwood Community Foundation - Project WAITT","DESCRIPTION\/MISSION":"Provides the following services to HIV\/AIDS Positive Individuals: rental assistance, mortgage assistance, utilities assistance, 18 bed transitional housing, nutrition counseling, health education\/wealth counseling, professional counseling","WEBSITE":"www.brentwoodfoundation.org"},"13":{"TYPE":"Social","ORGANIZATION":"Bunnies On The Bayou","DESCRIPTION\/MISSION":"Bunnies on the Bayou, Inc. is a 501(c)3, all volunteer organization dedicated to the raising and distributing of funds for various charitable, educational and cultural programs that seek to improve the quality of life and promote education and awareness of human rights for individuals in the Houston LGBT community. The organization raises money through a series of social events throughout the year, and culminates every Easter Sunday at Bunnies on the Bayou, the largest outdoor cocktail party in Texas.","WEBSITE":"www.bunniesonthebayou.org"},"14":{"TYPE":"Educational program","ORGANIZATION":"Center for the Study of Women, Gender, and Sexuality","DESCRIPTION\/MISSION":"Center for the Study of Women, Gender and Sexuality at Rice University","WEBSITE":"http:\/\/cswgs.rice.edu"},"15":{"TYPE":"Social","ORGANIZATION":"Classic Chassis Car Club","DESCRIPTION\/MISSION":"WELCOME to Classic Chassis Car Club Houston, the metro areaâ\u0080\u0099s LGBT Car Club.","WEBSITE":"http:\/\/www.classicchassishouston.org\/"},"16":{"TYPE":"History","ORGANIZATION":"Dalton DeHart Photographic Foundation","DESCRIPTION\/MISSION":"The Dalton DeHart Photographic Foundation mission is to digitize, catalog and preserve an expanding collection of approx. 1 million photos chronicling Houston's LGBTQ community to make these images publicly accessible for their educational, historic, and cultural value.","WEBSITE":"https:\/\/www.daltondehart.com\/"},"17":{"TYPE":"Social","ORGANIZATION":"Delta Phi Upsilon Fraternity","DESCRIPTION\/MISSION":"Delta Phi Upsilon's mission shall be to build better brothers by encouraging intellectual achievement, improving the public stature of gay people, promoting unity among gay men and support a progressive interest in the social and civic welfare of such men.","WEBSITE":"www.dphiu.org"},"18":{"TYPE":"Religious","ORGANIZATION":"Dignity Houston (Catholic)","DESCRIPTION\/MISSION":"DignityHouston is a lot of things, but most importantly, we are a community of lesbian, gay, transgender, bisexual and queer Catholics and allies who support each other in our faith and work towards a day when we will be fully accepted by our Church.","WEBSITE":"www.dignityhouston.org"},"19":{"TYPE":"Social","ORGANIZATION":"Empire of Royal Sovereign Imperial Court of the Single Star, Inc (ERSICSS)","DESCRIPTION\/MISSION":"Our organization has worked with and within our community to assist those in need. We have served as one of the leading organizations for female impersonators to combine their talents for a common goal.","WEBSITE":"www.ersicss.org"},"20":{"TYPE":"Advocacy","ORGANIZATION":"Equality Texas","DESCRIPTION\/MISSION":"Equality Texas works to secure full equality for lesbian, gay, bisexual, transgender, and queer Texans through political action, education, community organizing, and collaboration.","WEBSITE":"www.equalitytexas.org"},"21":{"TYPE":"Professional","ORGANIZATION":"Executive & Professional Association of Houston","DESCRIPTION\/MISSION":"The Executive and Professional Association of Houston (EPAH) was formed in April 1978 in Houston, Texas. It was established to provide a non-political forum for discusssion of business and community affairs, to encourage and foster social and business relationships among the membership, and to support such educational and\/or charitable causes as may be approved by the membership.","WEBSITE":"www.epah.org"},"22":{"TYPE":"Arts","ORGANIZATION":"Failure to Con\/Form","DESCRIPTION\/MISSION":"Failure to Con\/Form is an ad-hoc group of gender-non-conforming writers, performers & artists who have come together to sponsor a series of performance events in 2018.","WEBSITE":"https:\/\/www.facebook.com\/failuretoconformhouston\/"},"23":{"TYPE":"Social","ORGANIZATION":"Flyboys of Flag Troupe Houston","DESCRIPTION\/MISSION":"Flagging, flag-dancing,","WEBSITE":"www.houstonflyboys.com"},"24":{"TYPE":"Sports","ORGANIZATION":"Frontrunners Houston","DESCRIPTION\/MISSION":"Walking\/Running club for lgbt & allies","WEBSITE":"http:\/\/frontrunnershouston.org\/"},"25":{"TYPE":"Social","ORGANIZATION":"Gamma Mu Phi (Delta Chapter)","DESCRIPTION\/MISSION":"Gamma Mu Phi Fraternity, Inc. is committed to promoting the positive representation of the same gender loving, bisexual, and affirming men of color, while cultivating the highest ideals of: Brotherhood, Good Character, Manhood, Leadership, Loyalty, Professionalism, Scholarship, and Service. Gay","WEBSITE":"http:\/\/www.gmuphi.com\/"},"26":{"TYPE":"Social Services","ORGANIZATION":"Gay, Lesbian and Straight Education Network-Houston (GLSEN)","DESCRIPTION\/MISSION":"GLSEN Houston is a chapter of the Gay, Lesbian and Straight Education Network (GLSEN). GLSEN works to ensure safe schools for ALL students, regardless of sexual orientation and gender identity.","WEBSITE":"https:\/\/www.glsen.org\/chapters\/houston\/ourchapter"},"27":{"TYPE":"Professional","ORGANIZATION":"Greater Houston LGBT Chamber of Commerce","DESCRIPTION\/MISSION":"We accelerate economic growth for the lesbian, gay, bisexual and transgender business community using an entrepreneurial approach through a strong network of business allies, innovative programs, strategic partnerships and advance policies that foster inclusion and equality.","WEBSITE":"https:\/\/www.houstonlgbtchamber.com\/"},"28":{"TYPE":"History","ORGANIZATION":"Gulf Coast Archive Museum","DESCRIPTION\/MISSION":"Created to collect, preserve and provide access to historical items from the GLBT community in the gulf coast area of Texas","WEBSITE":"http:\/\/www.gcam.org\/"},"29":{"TYPE":"Social Services","ORGANIZATION":"HATCH","DESCRIPTION\/MISSION":"Hatch Youth is dedicated to empowering lesbian, gay, bisexual, transgender, queer, questioning, intersex, asexual and allied (LGBTQIA) youth, ages 13-20, to become positive contributors to society by providing a safe social environment, offering role models and peer support, and sponsoring educational and community outreach opportunities.","WEBSITE":"www.hatchyouth.org"},"30":{"TYPE":"Social","ORGANIZATION":"Houston Area Bears","DESCRIPTION\/MISSION":"The Houston Bears is a non-profit 501(c)(3) charitable and social organization based in Houston, Texas serving the greater Houston area. Our membership transcends gender, race, age and ethnicity to include bears, cubs, otters, admirers and other allies to the Bear Community. Gay men","WEBSITE":"http:\/\/houstonbears.org\/"},"31":{"TYPE":"Social","ORGANIZATION":"Houston Area HIV and Aging Coalition","DESCRIPTION\/MISSION":"HIV and Aging Coalition, Houston Area was established in August of 2013 to address two major issues that affect those living with an HIV infection that are over fifty years old. The first reason was to educate our community and agencies that serve us about issues that affect us and services that are available and or necessary. The second reason is to help break down the social isolation many people over fifty living with the infection face.","WEBSITE":"http:\/\/agingcoalition.org\/"},"32":{"TYPE":"Social","ORGANIZATION":"Houston Big Men's Club","DESCRIPTION\/MISSION":"We are a social organization for heavy-set gay and bisexual men and their male admirers. We provide a non-judgmental social environment for big men to meet other big men as well as smaller men who like big men. Gay men","WEBSITE":"http:\/\/groups.yahoo.com\/group\/houstonbigmensclub\/"},"33":{"TYPE":"Sports","ORGANIZATION":"Houston Billard Open","DESCRIPTION\/MISSION":"A billiards league was established in 1995 as a sports entity whose primary objective was serving billiard enthusiasts within the Greater Houston gay community.","WEBSITE":"www.iblhouston.com"},"34":{"TYPE":"Education & Services","ORGANIZATION":"Houston Gay & Lesbian Parents","DESCRIPTION\/MISSION":"HGLP is a diverse social group for lesbian, gay, bisexual, or transgender parents, their partners and their kids, and also parents in planning. Some of us are single and some of us are in relationships.","WEBSITE":"www.hglp.org"},"35":{"TYPE":"Social","ORGANIZATION":"Houston Gaymers","DESCRIPTION\/MISSION":"Houston Gaymers is highly active community group that provides a safe space for LGBT and fellow video game enthusiasts. Since 2009, the group has grown to become the largest video game community in Texas with an online user base of nearly 2000 members. Our membership supports local businesses through our monthly meetups with help from our 500+ local members in the greater Houston area.","WEBSITE":"https:\/\/houstongaymers.com\/"},"36":{"TYPE":"Political","ORGANIZATION":"Houston GLBT Politicial Caucus","DESCRIPTION\/MISSION":"LGBT political caucus","WEBSITE":"www.thecaucus.org"},"37":{"TYPE":"Sports","ORGANIZATION":"Houston Invitational","DESCRIPTION\/MISSION":"LGBT bowling tournament, sports, team","WEBSITE":"www.houstoninvite.com"},"38":{"TYPE":"Social","ORGANIZATION":"Houston Leather Boys","DESCRIPTION\/MISSION":"Gay men, leather","WEBSITE":"http:\/\/www.houstonboysofleather.org\/"},"39":{"TYPE":"Political","ORGANIZATION":"Houston Log Cabin Republicans","DESCRIPTION\/MISSION":"Log cabin republicans","WEBSITE":"http:\/\/www.logcabinhouston.org\/"},"40":{"TYPE":"Sports","ORGANIZATION":"Houston Outdoor Group (HOG)","DESCRIPTION\/MISSION":"The Houston Outdoor Group (HOG) is a social group for members of the GLBTQ community who enjoy the outdoors. Sports","WEBSITE":"www.houstonoutdoorgroup.org"},"41":{"TYPE":"Arts","ORGANIZATION":"Houston Pride Band","DESCRIPTION\/MISSION":"Serving as a community band in Houston's gay, lesbian, bisexual, and transgender community, the Houston Pride Band has several groups that perform at community events throughout the year as well as concerts and parades. We also provide a fun social experience for musicians.","WEBSITE":"www.houstonprideband.org"},"42":{"TYPE":"Pride","ORGANIZATION":"Houston Splash","DESCRIPTION\/MISSION":"Houston Splash, often referred to as Black Gay Pride, is an unapologetic celebration of Black and Latinx LGBTQ Pride.","WEBSITE":"www.houstonsplash.com"},"43":{"TYPE":"Political","ORGANIZATION":"Houston Stonewall Democrats","DESCRIPTION\/MISSION":"Stonewall Democrats is composed ofÂ passionate progressive members of the GLBTQ Community and straight allies to promote civil rights and equality through our grassroots-based Democratic political organization.","WEBSITE":"http:\/\/www.stonewalldemocrats.us\/new-cover-page-1"},"44":{"TYPE":"Political","ORGANIZATION":"Houston Stonewall Young Democrats","DESCRIPTION\/MISSION":"Stonewall youth democrats. Pro-equality for LGBT.","WEBSITE":"http:\/\/www.houstonstonewallyd.com\/"},"45":{"TYPE":"Sports","ORGANIZATION":"Houston Tennis Club","DESCRIPTION\/MISSION":"Athletic competition in sport of tennis.","WEBSITE":"www.houstontennisclub.org"},"46":{"TYPE":"Social","ORGANIZATION":"Houston Transgender Unity Community","DESCRIPTION\/MISSION":"The Houston Transgender Unity Committee (HTUC) was formed to plan and coordinate common activities for the Houston Transgender Community","WEBSITE":"www.HTUC.org"},"47":{"TYPE":"Social","ORGANIZATION":"Houston's People Exchanging Power","DESCRIPTION\/MISSION":"BDSM\/Fetish community","WEBSITE":"https:\/\/hpep.org\/hpep\/"},"48":{"TYPE":"Advocacy","ORGANIZATION":"Human Rights Campaign Houston Steering Committee","DESCRIPTION\/MISSION":"Advocate equal rights for LGBTQ community.","WEBSITE":"https:\/\/www.hrchouston.org\/"},"49":{"TYPE":"Social","ORGANIZATION":"Iftikhar Community of Texas","DESCRIPTION\/MISSION":"Iftikhar was founded to exclusively serve LGBTQ+ Muslim, Arab, and South Asian (MASA) individuals and the challenges they face. Iftikhar believes strongly in creating safe spaces for LGBTQ+ people who possess unique challenges resulting from their MASA cultural, linguistic, and religious identities.","WEBSITE":"https:\/\/www.facebook.com\/IftikharCommunity\/?ref=br_rs"},"50":{"TYPE":"Social","ORGANIZATION":"Impulse Group Houston","DESCRIPTION\/MISSION":"Impulse Group is an international group dedicated to promoting healthier sexual lifestyles among gay men in 18 cities around the world.","WEBSITE":"https:\/\/impulsegrp.org\/"},"51":{"TYPE":"Religious","ORGANIZATION":"Integrity Houston","DESCRIPTION\/MISSION":"St. Stephen's Episcopal Church.","WEBSITE":"integrityusa.org"},"52":{"TYPE":"Religious","ORGANIZATION":"Jewish Gay and Lesbian Social Group of Houston","DESCRIPTION\/MISSION":"Jewish Family Service is a non-profit human service agency for people of all ages and all walks of life.","WEBSITE":"www.jfshouston.org"},"53":{"TYPE":"Social","ORGANIZATION":"Kappa Psi Kappa","DESCRIPTION\/MISSION":"Kappa Psi Kappa Fraternity, Inc is a non-collegiate Service Social Fraternity for men from all walks of life.","WEBSITE":"https:\/\/www.kappapsikappa.org\/"},"54":{"TYPE":"Social","ORGANIZATION":"Krewe of Olympus-Texas, Inc.","DESCRIPTION\/MISSION":"Mardi Gras Krewe, LGBTQ","WEBSITE":"www.kreweofolympus.org"},"55":{"TYPE":"Professional","ORGANIZATION":"Lambda Legal","DESCRIPTION\/MISSION":"Lambda Legal. Protect & advance LGBT rights","WEBSITE":"www.lambdalegal.org"},"56":{"TYPE":"Social Services","ORGANIZATION":"Legacy Community Health","DESCRIPTION\/MISSION":"Legacy Community Health. A full-service, Federally Qualified Health Center, Legacy identifies unmet needs and gaps in health-related services and develops client-centered programs to address those needs. We currently provide adult primary care, pediatrics, dental care, vision services, behavioral health services, OB\/GYN and maternity, vaccinations and immunizations, health promotion and community outreach, wellness and nutrition, and comprehensive HIV\/AIDS care.","WEBSITE":"https:\/\/www.legacycommunityhealth.org\/"},"57":{"TYPE":"Social Services","ORGANIZATION":"Lesbian Health Initiative","DESCRIPTION\/MISSION":"Lesbian Health Initiative of Houston, Inc. Promote LGBTQ health","WEBSITE":"www.lhihouston.org"},"58":{"TYPE":"Social","ORGANIZATION":"Lesbians of Color (LOC)","DESCRIPTION\/MISSION":"Lesbians of Color. Any woman, regardless of color or ethnicity, who wishes to enjoy this community and friendships this group has to offer should join us!","WEBSITE":"weareloc.com"},"59":{"TYPE":"Social","ORGANIZATION":"Lesbians Over Age Fifty (L.O.A.F)","DESCRIPTION\/MISSION":"L.O.A.F is a social networking and support group for women fifty years of age and older, and their partners, whatever their age. Elders","WEBSITE":"http:\/\/www.lesbiansoverage50.org\/"},"60":{"TYPE":"Social","ORGANIZATION":"LIVE Consortium","DESCRIPTION\/MISSION":"HIV\/Anti-Stigma education, support, etc.","WEBSITE":"www.liveconsortium.org"},"61":{"TYPE":"Student Organization","ORGANIZATION":"Lone Star College Gender Sexuality Alliance","DESCRIPTION\/MISSION":"GSA, education, school","WEBSITE":"http:\/\/www.lonestar.edu\/16096.htm"},"62":{"TYPE":"Social","ORGANIZATION":"Lone Star Nudist Group","DESCRIPTION\/MISSION":"Non sexual nude experience, Gay men","WEBSITE":"www.houstonlsng.com"},"63":{"TYPE":"Social","ORGANIZATION":"Lone Star Veterans Association - LGBT Group","DESCRIPTION\/MISSION":"Bridge the gap between the veteran and LGBT communities, while making a positive impact in the external community.","WEBSITE":"https:\/\/www.lonestarveterans.org\/lgbt"},"64":{"TYPE":"Sports","ORGANIZATION":"Lone Star Volleyball Assoc. (LSVA)","DESCRIPTION\/MISSION":"Volleyball for LGBTQ, sports, team","WEBSITE":"https:\/\/www.lonestarvolleyball.org\/"},"65":{"TYPE":"Education","ORGANIZATION":"M.D. Anderson Cancer Center GLBT","DESCRIPTION\/MISSION":"The University of Texas MD Anderson Cancer Center is a very small public LGBT-friendly college located in Houston, Texas.","WEBSITE":"https:\/\/lgbt-colleges.com\/anderson-cancer-center"},"66":{"TYPE":"Advocacy","ORGANIZATION":"Mayor Turner's LGBTQ Advisory Board","DESCRIPTION\/MISSION":"The LGBTQ Advisory Board exists to serve as a liaison between the LGBTQIAP+ community and the Mayor.","WEBSITE":"https:\/\/www.lgbtqhouston.org\/"},"67":{"TYPE":"Social","ORGANIZATION":"Misfits","DESCRIPTION\/MISSION":"Social club for gay men","WEBSITE":"https:\/\/misfitshouston.com\/"},"68":{"TYPE":"Social Services","ORGANIZATION":"Montrose Center","DESCRIPTION\/MISSION":"The Montrose Center empowers our community, primarily lesbian, gay, bisexual and transgender individuals and their families, to enjoy healthier and more fulfilling lives. We are Houston's LGBTQ+ community center.","WEBSITE":"http:\/\/www.montrosecenter.org\/hub\/"},"69":{"TYPE":"Social Services","ORGANIZATION":"Montrose Grace Place","DESCRIPTION\/MISSION":"Montrose Grace Place opens its doors to homeless youth of all sexual orientations and gender identities who are between the ages of 13 and 21 years old. Youth night is an evening of food, mentorship, and skills building.","WEBSITE":"https:\/\/www.montrosegraceplace.org\/"},"70":{"TYPE":"Sports","ORGANIZATION":"Montrose Softball League Association","DESCRIPTION\/MISSION":"The Montrose Softball League Association (MSLA) is dedicated to the promotion of amateur softball for all persons, age 18 and older, regardless of race, creed, religious, sex, or national origin, with special emphasis placed on the participation of members of the LGBTQ community of Greater Houston.","WEBSITE":"www.HoustonMSLA.org"},"71":{"TYPE":"Advocacy","ORGANIZATION":"M-PACT Houston Task Force","DESCRIPTION\/MISSION":"Reducing HIV and other STI's among gay men throughout the Houston area.","WEBSITE":"https:\/\/www.facebook.com\/MpactHouston\/"},"72":{"TYPE":"Arts","ORGANIZATION":"MuejeresMalas","DESCRIPTION\/MISSION":"Mujeres malas is an artist collective of self-identifying women. We challenge ideas of latinidad and oppression without the limitations of censorship.","WEBSITE":"https:\/\/www.facebook.com\/SOMOSMUJERESMALAS\/"},"73":{"TYPE":"History","ORGANIZATION":"Names Project Houston","DESCRIPTION\/MISSION":"Memorial for HIV\/AIDs. The NAMES Project AIDS Memorial Quilt, often abbreviated to AIDS Memorial Quilt, is an enormous quilt made as a memorial to celebrate the lives of people who have died of AIDS-related causes.","WEBSITE":"https:\/\/www.aidsquilt.org\/"},"74":{"TYPE":"Social","ORGANIZATION":"National Leather Assoc. - Houston","DESCRIPTION\/MISSION":"dispell BDSM stereotypes","WEBSITE":"www.nlahoustontx.org"},"75":{"TYPE":"Social Services","ORGANIZATION":"O.P.T. Youth","DESCRIPTION\/MISSION":"O.P.T. YOUTH (Out. Proud. Together.) is a one-to-one mentoring program providing services to the Lesbian, Gay, Bisexual, and Transgender (LGBT) youth in the Houston Metropolitan area. This is a program that matches interested youth with adults in a collaborative process, with a specific focus on middle and high school aged LGBT students.","WEBSITE":"http:\/\/www.optyouth.org\/"},"76":{"TYPE":"History","ORGANIZATION":"oH Project","DESCRIPTION\/MISSION":"The oH Project collection: Oral Histories of HIV\/AIDS in Houston","WEBSITE":"https:\/\/scholarship.rice.edu\/handle\/1911\/91682"},"77":{"TYPE":"Education & Services","ORGANIZATION":"Organizacion Latina de Trans en Texas (OLTT)","DESCRIPTION\/MISSION":"\\n\\nWe are a community-based organization, made up of Trans people for Trans people (Transsexuals, Transgender and Intersex) and our allies, we maintain our work focus for visibility and eligibility, human rights and the well-being of our community, through empowerment, community organization that allows promoting a political incidence in equity and equality.","WEBSITE":"http:\/\/www.latinatranstexas.org\/"},"78":{"TYPE":"Pride","ORGANIZATION":"Orgullo Houston","DESCRIPTION\/MISSION":"Latinx LGBTQ Pride is a non-profit organization whose mission is to seek out, recognize and celebrate the contributions of LGBTQ Latinx Houstonians.","WEBSITE":"http:\/\/orgullohouston.org"},"79":{"TYPE":"Professional","ORGANIZATION":"Out and Equal","DESCRIPTION\/MISSION":"Out & Equal Workplace Advocates is the worldâ\u0080\u0099s premier nonprofit organization dedicated to achieving lesbian, gay, bisexual, transgender, and queer workplace equality.","WEBSITE":"www.outandequal.org"},"80":{"TYPE":"Education & Services","ORGANIZATION":"Out for Education","DESCRIPTION\/MISSION":"We provide scholarships to LGBT youth from the Houston area or attending college or universities in Houston.","WEBSITE":"http:\/\/outforeducation.org\/"},"81":{"TYPE":"Social","ORGANIZATION":"OUTreach United","DESCRIPTION\/MISSION":"We are a nonprofit organization dedicated to helping bring a better and more positive awareness and understanding to the Houston LGBT community.","WEBSITE":"www.outreachunited.org"},"82":{"TYPE":"Social Services","ORGANIZATION":"Pet Patrol","DESCRIPTION\/MISSION":"An organization that recognizes the proven health benefits of companion animals and is dedicated to preserving the human-animal bond.","WEBSITE":"www.thepetpatrol.org"},"83":{"TYPE":"Advocacy","ORGANIZATION":"PFLAG Houston","DESCRIPTION\/MISSION":"PFLAG members are dedicated to supporting LGBTQ people and keeping them united with family members, friends and allies. PFLAGâ\u0080\u0099s goal is to protect civil rights and promote equality for all citizens through a three-fold mission of support, education and advocacy.","WEBSITE":"www.pflaghouston.org"},"84":{"TYPE":"Social","ORGANIZATION":"Pride Houston","DESCRIPTION\/MISSION":"Pride Houston celebrates the individuality and diversity of every person as we all strive for acceptance from parents, friends and society-at-large. From annual charity events to aiding LGBT-support and -counseling networks, its activities continue to promote social awareness and enrich the diversity that helps the Houston community thrive.","WEBSITE":"www.pridehouston.org"},"85":{"TYPE":"Social","ORGANIZATION":"Prime Timers-Houston","DESCRIPTION\/MISSION":"Prime Timers Houston is a social organization that has served gay and bi-sexual men from the Greater Houston area for over 25 years.Â Prime Timers Houston provides an variety of monthly activities that afford men, most of whom are over 40 years old, with an opportunity to enjoy socializing numerous times each month.","WEBSITE":"http:\/\/www.primetimersww.net\/houston\/"},"86":{"TYPE":"Religious","ORGANIZATION":"Progressive Open Door Christian Center","DESCRIPTION\/MISSION":"Our mission is to lead every willing individual into a committed and growing relationship with Jesus Christ and while doing so provide a safe worship environment where all can experience spiritual healing and growth.","WEBSITE":"www.podcc.org"},"87":{"TYPE":"Social Services","ORGANIZATION":"Project WAITT","DESCRIPTION\/MISSION":"Project WAITT provides the following programs to support people with HIV\/AIDS:\\nRental Assistance\\nMortgage Assistance\\nUtilities Assistance (electric, gas, telephone, and water)\\n18 bed Transitional Housing (on-site living facility)\\nNutrition Counseling\\nHealth Education\/Wellness Counseling\\nPermanent Housing Placement\\nThe services are provided to clients living in Fort Bend, Liberty, Montgomery, Chambers, Waller and Harris counties. Clients are referred to the program by an HIV service provider, a Case Manager or by individual contacts.","WEBSITE":"http:\/\/brentwoodfoundation.org\/our-programs\/project-waitt\/"},"88":{"TYPE":"Education & Services","ORGANIZATION":"PWA Holiday Charities","DESCRIPTION\/MISSION":"Our Mission Statement is to raise funds (through donations and charitable events) and to distribute 100% of those funds for the betterment of people living with and affected by HIV\/AIDS during the holidays.","WEBSITE":"www.pwaholidaycharities.org"},"89":{"TYPE":"Education & Services","ORGANIZATION":"Q & A (Queers & Allies) Rice University","DESCRIPTION\/MISSION":"Rice University's LGBT school organization","WEBSITE":"https:\/\/ricepride.rice.edu\/"},"90":{"TYPE":"Social","ORGANIZATION":"Collective of Houston Asian Americans","DESCRIPTION\/MISSION":"A collective of Asian American Queer Houstonians committed to intersectional work around our identities, our communities, and fellow communities of color.\\nAsian American LGBTQQIA+ folks and friends\/allies to us in this particular intersection of experiences. We consider Asian American a wide umbrella - including but not limited to Asian, South Asian, Southeast Asian, Pacific Islander, and multi-racial Asian folks. LGBTQQIA+ also does not fully capture all the possibilities we're about. If you consider yourself somewhere on the spectrum, to the side of it, or on journey with yourself in relation to it, we'd love to have you!\\n","WEBSITE":"https:\/\/www.facebook.com\/chaa.houston\/"},"91":{"TYPE":null,"ORGANIZATION":"R.O.A.R.","DESCRIPTION\/MISSION":"R.O.A.R Inc. â\u0080\u0093 Is an organization thatâ\u0080\u0099s committed to help relieve LGBTQ families from the oppression placed on them by society, religious and loved ones.","WEBSITE":"https:\/\/www.facebook.com\/R.O.A.R.Incorporated\/"},"92":{"TYPE":"Education & Services","ORGANIZATION":"Renegade Library","DESCRIPTION\/MISSION":"Renegade Library is Houston's LGBT Pop Up library","WEBSITE":"https:\/\/renegadelibraries.wixsite.com\/renegadelibrary"},"93":{"TYPE":"Religious","ORGANIZATION":"Ressurection MCC","DESCRIPTION\/MISSION":"We are a movement that faithfully proclaims Godâ\u0080\u0099s inclusive love for all people and proudly bears witness to the holy integration of spirituality and sexuality. Resurrection MCC is open to everyone. We share the love of God with all people just as they are.","WEBSITE":"www.resurrectionMCC.org"},"94":{"TYPE":"Education & Services","ORGANIZATION":"Save Our Sisters United (SOS)","DESCRIPTION\/MISSION":"Save Our Sister was founded by a few like mind Transgender women of color in the Houston area. The purpose of the group was to develop a safe space for trans-women to exist without the guards of and stigma related challenges that everyday society imposes","WEBSITE":"https:\/\/www.facebook.com\/saveoursistersunited\/"},"95":{"TYPE":"Social Services","ORGANIZATION":"Seniors Preparing For Rainbow Years (SPRY)","DESCRIPTION\/MISSION":"The \"Seniors Preparing For Rainbow Years â\u0080\u0093 SPRY\" Program provides gay seniors with counseling, therapy and peer support, along with help navigating social security, medi-care, disability and other benefit programs.","WEBSITE":"http:\/\/www.programsforelderly.com\/health-spry-therapy-gay-seniors.php"},"96":{"TYPE":"Social","ORGANIZATION":"Some Transgenders Are Guys (STAG)","DESCRIPTION\/MISSION":"STAG (Some Transgenders are Guys) is a group for transgender people who identify as male or masculine. We discuss topics relevant to our transitions, such as relationships, employment, surgery, and hormones.","WEBSITE":"https:\/\/www.transhouston.com\/stag\/"},"97":{"TYPE":"Sports","ORGANIZATION":"Southern Country Houston - Dance Group","DESCRIPTION\/MISSION":"SoCoHo, founded in 1991, is a country western dance organization in southeast Texas. Although we exist to provide a comfortable and safe place for LGBTQ people, we do not discriminateâ\u0080\u0094everyone is welcome.","WEBSITE":"www.southerncountryhouston.com"},"98":{"TYPE":"Pride","ORGANIZATION":"Splash Houston","DESCRIPTION\/MISSION":"Houston Splash is a premiere urban LGBT event for the Southern United states. Houston Splash caters to African-American and Latino LGBT men and women from across the country.","WEBSITE":"http:\/\/www.houstonsplash.com\/about-us\/"},"99":{"TYPE":"Social","ORGANIZATION":"Texas Gay Rodeo Association","DESCRIPTION\/MISSION":"Texas Gay Rodeo Association is a Texas non-profit corporation dedicated to elevating the image of women and men in the field of rodeo. We are proud of our thirty year history of gay rodeos and of our record of donating more than $2,750,000 to Texas charities.","WEBSITE":"www.TGRA.org"},"100":{"TYPE":"Social","ORGANIZATION":"The Diana Foundation","DESCRIPTION\/MISSION":"The Diana Foundation is focused on assisting and supporting the needs of the gay community, by distributing funds to organizations that are dedicated to providing services that enhance the lives of deserving individuals in our diverse community.","WEBSITE":"https:\/\/thedianafoundation.org\/"},"101":{"TYPE":"Social Services","ORGANIZATION":"The Lazarus House","DESCRIPTION\/MISSION":"The Lazarus House is dedicated to helping the community of Houston successfully combat and manage cachexia, or disease related muscle loss. Cachexia is the devastating cycle of malnutrition and muscle wasting that accompanies numerous chronic illnesses like cancer, HIV\/AIDS, lupus, muscular dystrophy, and even situations like spinal cord trauma.","WEBSITE":"www.thelazarushouse.org"},"102":{"TYPE":"Education & Services","ORGANIZATION":"The Mahogany Project Inc.","DESCRIPTION\/MISSION":"The purpose of the Mahogany Project is to facilitate a discussion around the daily lives and experiences of black queer men within the larger within the Texas community through a series of theatrical peices based on interviews conducted by the creators.","WEBSITE":"https:\/\/www.themahoganyproject.com\/about"},"103":{"TYPE":"Pride","ORGANIZATION":"The Woodlands Pride","DESCRIPTION\/MISSION":"A nonprofit organization with a mission To connect, celebrate, educate and foster relationships in the LGBTQIA community while promoting equality, unity, and love in The Woodlands and beyond.","WEBSITE":"https:\/\/thewoodlandstxpride.wordpress.com\/"},"104":{"TYPE":"Advocacy","ORGANIZATION":"Transform Houston","DESCRIPTION\/MISSION":"Building a broad and inclusive powerful political movement while shifting public opinion in support of LGBTQ nondiscrimination and achieving policy victories in support of equality.","WEBSITE":"http:\/\/www.transformhouston.org\/"},"105":{"TYPE":"Education & Services","ORGANIZATION":"Transgender Foundation of America - Houston","DESCRIPTION\/MISSION":"Transgender Foundation of America (TFA) is a Houston, Texas-based non-profit organization whose mission is to advance the quality of life for transgender people. TFA engages in community development through education and outreach resources. Additionally, TFA runs a Transgender Archive and museum space called the Transgender Archives","WEBSITE":"www.tgctr.org"},"106":{"TYPE":"Social","ORGANIZATION":"TRI-ESS","DESCRIPTION\/MISSION":"Tri-Ess is an educational, social and support group for heterosexual crossdressers, their partners, the spouses of married crossdressers and their families.","WEBSITE":"https:\/\/www.tri-ess.org\/"},"107":{"TYPE":null,"ORGANIZATION":"Gay & Lesbian Switchboard Houston","DESCRIPTION\/MISSION":"LGBT Switchboard 24-Hour Helpline [formerly Gay & Lesbian Switchboard Houston] has been on the line for Houstonâ\u0080\u0099s GLBT community since 1982.","WEBSITE":"http:\/\/www.montrosecenter.org\/hub\/services\/avp\/switchboard\/"},"108":{"TYPE":null,"ORGANIZATION":"United Way Help Line","DESCRIPTION\/MISSION":"Whether you need help finding child care, food stamps, care for an aging parent or a haven from domestic violence, 2-1-1 is the number to call when you don't know who to call. Our trained HELPLINE specialists are good listeners, blending understanding and expertise to provide information and referrals drawn from a comprehensive database of social services.","WEBSITE":"https:\/\/www.unitedwayhouston.org\/our-211-helpline"},"109":{"TYPE":null,"ORGANIZATION":"City of Houston","DESCRIPTION\/MISSION":"The 311 Houston Service Helpline, a consolidated call center designed to make city government more user-friendly and responsive to city residents by providing citizens with a one telephone number to call for information on city services and to report non-emergency concerns.","WEBSITE":"http:\/\/www.houstontx.gov\/311\/"},"110":{"TYPE":null,"ORGANIZATION":"Baylor Teen Clinic","DESCRIPTION\/MISSION":"The Teen Health Clinic currently provides pregnancy testing, family planning, sexually transmitted diseases (STD) and HIV\/AIDS education and screening, primary healthcare, and case management services to teens, their partners, and children in Harris County. The clinics provide services to teens in and out of school using outreach workers and community educators.","WEBSITE":"Web: www.teenhealthclinic.org"},"111":{"TYPE":null,"ORGANIZATION":"The Beacon (Cathedral Health Ministries)","DESCRIPTION\/MISSION":"The Beacon is a non-profit organization that serves the Houston homeless community through daily services, civil legal aid, counseling and mentoring and access to housing. Our mission is to provide essential and next-step services to restore hope and help end homelessness in Houston.","WEBSITE":"www.helpthebeacon.com"},"112":{"TYPE":null,"ORGANIZATION":"Bee Busy, Inc.","DESCRIPTION\/MISSION":"Bee Busy Wellness Center is a Federally Qualified Health Center providing the highest quality of health care. We were recently accredited by The Joint Commissions and certified as a Primary Care Medical Home. Our clinical team is staffed by highly-skilled Doctors, Board Certified Nurse Practitioners, and Licensed Clinical Social Workers.","WEBSITE":"www.mybbwc.org"},"113":{"TYPE":null,"ORGANIZATION":"Bread of Life","DESCRIPTION\/MISSION":"The Bread of Life, Inc. was launched in September 1992 with the serving of hot meals to homeless men and women in the sanctuary of St. John's United Methodist Church.","WEBSITE":"www.breadoflifeinc.org"},"114":{"TYPE":null,"ORGANIZATION":"The Center for Success & Independence (TCSI)","DESCRIPTION\/MISSION":"The Center for Success and Independence (TCSI) is an adolescent residential and intensive outpatient treatment center providing evidence-based therapy for teens with substance abuse and mental health issues.","WEBSITE":"www.tcsi.org"},"115":{"TYPE":null,"ORGANIZATION":"Covenant House","DESCRIPTION\/MISSION":"Covenant House Texas (CHT) opened its doors in 1983 to provide shelter for homeless, abused and abandoned youth ages 18 â\u0080\u0093 24. After more than 35 years of service, CHT offers an extensive continuum of care model for homeless youth including mental health and substance abuse counseling, educational and vocational training, transitional and permanent living programs, street outreach and prevention, pastoral ministry and parenting classes in addition to providing the basic necessities of food, clothing, medical care and safe shelter from the streets for youth in crisis.","WEBSITE":"www.covenanthousetx.org\/"},"116":{"TYPE":null,"ORGANIZATION":"Crossroads at Park Place","DESCRIPTION\/MISSION":"Our mission is simple: to provide services to promote the health, hygiene, and dignity of all persons experiencing homelessness and poverty in Southeast Houston.","WEBSITE":"http:\/\/crossroadsatparkplace.org\/"},"117":{"TYPE":null,"ORGANIZATION":"DePelchin Childrenâ\u0080\u0099s Center","DESCRIPTION\/MISSION":"DePelchin Childrenâ\u0080\u0099s Center believes that every child deserves to be safe and healthy. An accredited foster care and adoption agency, DePelchin serves the most vulnerable children and families in Texas and works to break the cycles of abuse and neglect.","WEBSITE":"www.depelchin.org\/"},"118":{"TYPE":null,"ORGANIZATION":"Disability Rights Texas","DESCRIPTION\/MISSION":"Our mission is to help people with disabilities understand and exercise their rights under the law, ensuring their full and equal participation in society.","WEBSITE":"www.disabilityrightstx.org\/"},"119":{"TYPE":null,"ORGANIZATION":"Emergency Aid Food Coalition","DESCRIPTION\/MISSION":"Emergency Aid Coalition is an interfaith organization that collaborates to provide temporary assistance in the form of food, clothing and other basic needs, with an emphasis on serving the working poor.","WEBSITE":"www.eachouston.org\/clients.html"},"120":{"TYPE":null,"ORGANIZATION":"Gender Infinity","DESCRIPTION\/MISSION":"Gender Infinity creates affirming spaces for families, learners, advocates, and providers to advance relationships, knowledge, and resources that empower gender diverse individuals.","WEBSITE":"http:\/\/genderinfinity.org\/"},"121":{"TYPE":null,"ORGANIZATION":"Goodwill Job Connection","DESCRIPTION\/MISSION":"Call the Job Connection Center nearest you for more information, to schedule an appointment, or to determine your eligibility for specific programs.","WEBSITE":"https:\/\/www.goodwillhouston.org\/services\/job-connection-centers\/"},"122":{"TYPE":null,"ORGANIZATION":"The HAY Center","DESCRIPTION\/MISSION":"The HAY Center, a program of Harris County Protective Services, is a one-stop center where current and former foster youth, ages 16-25, can acquire a variety of transition resources, services and support. Current Foster Youth: Life Skills Classes and Assessments, Independent Living Case Planning and Supportive Services, Annual Events\/Activities Former Foster Youth: After-Care Services (14+ Services), College assistance","WEBSITE":"www.haycenter.org\/"},"123":{"TYPE":null,"ORGANIZATION":"Health Care for the Homeless Houston","DESCRIPTION\/MISSION":"The mission of Healthcare for the Homeless - Houston is to promote health, hope and dignity for those affected by homelessness through accessible and comprehensive quality care.","WEBSITE":"www.homeless-healthcare.org"},"124":{"TYPE":null,"ORGANIZATION":"Homeless Court","DESCRIPTION\/MISSION":"The Coalition for the Homeless of Houston\/Harris County is a private, nonprofit organization whose mission is to provide leadership in the development, advocacy, and coordination of community strategies to prevent and end homelessness.","WEBSITE":"www.homelesshouston.org"},"125":{"TYPE":null,"ORGANIZATION":"Houston Area Community Services (HACS)","DESCRIPTION\/MISSION":"The mission of Houston Area Community Services, Inc. (HACS), is to provide a compassionate medical home for all people in Harris County, Texas, regardless of economic status.","WEBSITE":"https:\/\/npin.cdc.gov\/featured-partner\/houston-area-community-services-inc-hacs"},"126":{"TYPE":null,"ORGANIZATION":"Houston Volunteer Lawyers","DESCRIPTION\/MISSION":"The mission of Houston Volunteer Lawyers is to provide free legal services to low-income people in Harris County and to promote volunteerism among lawyers.","WEBSITE":"www.makejusticehappen.org\/node\/24\/how-get-help"},"127":{"TYPE":null,"ORGANIZATION":"Harris County Protective Services\\nfor Children and Adults","DESCRIPTION\/MISSION":"To support, enhance and advocate for the safety and well-being of children and adults in Harris County.","WEBSITE":"https:\/\/hcps.harriscountytx.gov\/"},"128":{"TYPE":null,"ORGANIZATION":"Open Gate Homeless Ministry","DESCRIPTION\/MISSION":"Open Gate Homeless Ministry at Bering Memorial United Methodist Church serves marginalized and LGBT young adults who are experiencing homelessness and unstable housing in the Houston.","WEBSITE":"http:\/\/beringopengate.org\/"},"129":{"TYPE":null,"ORGANIZATION":"Planned Parenthood Gulf Coast","DESCRIPTION\/MISSION":"Planned Parenthood is one of the nationâ\u0080\u0099s leading providers of high-quality, affordable health care, and the nationâ\u0080\u0099s largest provider of sex education. With or without insurance, you can always come to us for your health care.","WEBSITE":"https:\/\/www.plannedparenthood.org\/health-center\/texas\/houston\/77023\/prevention-park-health-center---family-planning-2291-91650?utm_campaign=prevention-park-family-planning-health-center&utm_medium=organic&utm_source=local-listing"},"130":{"TYPE":null,"ORGANIZATION":"ReVision","DESCRIPTION\/MISSION":"reVision works to break the cycle of isolation among the most profoundly disconnected youth, most of whom are caught up in the juvenile justice system.","WEBSITE":"www.houstonrevision.org"},"131":{"TYPE":null,"ORGANIZATION":"Salvation Army","DESCRIPTION\/MISSION":"Salvation Army provides a broad range of social services and compassion for thousands of individuals and families, serving Harris, Fort Bend and Montgomery counties at 17 locations.","WEBSITE":"http:\/\/salvationarmyhouston.org\/"},"132":{"TYPE":null,"ORGANIZATION":"Young Adult Resource Center YARC","DESCRIPTION\/MISSION":"In response to a growing number of young adults experiencing homelessness, The Salvation Army also operates a Young Adult Resource Center (YARC) for young adults ages 18 to 25. We aim to connect young people to housing and other mainstream support. Visitors to YARC receive meals, job coaching, recovery coaching, and non-traditional educational support, tutoring, and re-engagement.","WEBSITE":"http:\/\/salvationarmyhouston.org\/yarc\/"},"133":{"TYPE":null,"ORGANIZATION":"Harbor Light Center & Red Shield","DESCRIPTION\/MISSION":"The Salvation Armyâ\u0080\u0099s Red Shield Lodge offers a safe and dignified place where men experiencing homelessness can receive emergency shelter, warm and nutritious meals, job training and employment assistance, counseling and spiritual care. Our caseworkers also connect men to resources to help them find housing and achieve self-sufficiency.","WEBSITE":"salvationarmyhouston.org\/harbor-light\/"},"134":{"TYPE":null,"ORGANIZATION":"Family Residence","DESCRIPTION\/MISSION":"The Family Residence provides a place of safety and healing for women and children, many of whom are victims of domestic violence, crime, and generational poverty.","WEBSITE":"http:\/\/salvationarmyhouston.org\/family-residence\/"},"135":{"TYPE":null,"ORGANIZATION":"SEARCH Resource Center","DESCRIPTION\/MISSION":"Since 1989, SEARCH has been providing hope, creating opportunity, and transforming lives for thousands of men, women, and children who are trying to break free from the cycle of poverty and homelessness. At SEARCH, we maintain a vision of a Houston without homelessness.","WEBSITE":"https:\/\/www.searchhomeless.org\/"},"136":{"TYPE":null,"ORGANIZATION":"SER Jobs for Progress","DESCRIPTION\/MISSION":"SER is a nonprofit community organization that educates and equips people in the Texas Gulf Coast Region who come from low-income backgrounds or who have significant barriers to employment.","WEBSITE":"https:\/\/serhouston.org\/"},"137":{"TYPE":null,"ORGANIZATION":"Stand Up for Kids at The Haven Center","DESCRIPTION\/MISSION":"Through the Drop-in center, the clients have a safe place to socialize, to enjoy a hot meal and to take with them basic necessities such as hygiene supplies, clothing, shoes and food. For a few hours at the center, the youth can take the advantage of our services and resources. We provide help in obtaining ID, resume preparation, and resources for housing. Our third program, Apartment Support, emerged in 2013 to provide food and housing supplies to clients who were able to obtain housing through various grants.","WEBSITE":"www.standupforkids.org\/Houston"},"138":{"TYPE":null,"ORGANIZATION":"Texas Workforce: WF SOLUTIONS-DOWNTOWN","DESCRIPTION\/MISSION":"To promote and support an effective workforce system that offers employers, individuals and communities the opportunity to achieve and sustain economic prosperity.","WEBSITE":"https:\/\/twc.texas.gov\/"},"139":{"TYPE":null,"ORGANIZATION":"Tonyâ\u0080\u0099s Place (Homeless Gay Kids â\u0080\u0093 Houston)","DESCRIPTION\/MISSION":"Tonyâ\u0080\u0099s Place provides for kidsâ\u0080\u0099 immediate needs, as well as to be a place where they can learn life skills for a better future.","WEBSITE":"http:\/\/www.tonysplace.org\/"},"140":{"TYPE":null,"ORGANIZATION":"Trans Teens Online Talk Group","DESCRIPTION\/MISSION":"LGBT National Help Center is a private volunteer one-to-one online chat, that helps both youth and adults with coming-out issues, safer-sex information, school bullying, family concerns, relationship problems and a lot more.","WEBSITE":"https:\/\/www.glbthotline.org\/"},"141":{"TYPE":null,"ORGANIZATION":"Unlimited Visions","DESCRIPTION\/MISSION":"Unlimited Visions provides highly effective and evidenced-based, person-centered care in an outpatient, residential, and recovery environment that meets the spiritual, physical, and emotional needs of adults, adolescents and their families who struggle with Substance Use Disorders (SUD) while gaining a better quality of life on their journey of recovery.","WEBSITE":"http:\/\/www.unlimitedvisions.org\/"}}